###################################################################

# Created by write_sdc on Sat May 28 11:48:19 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions slow -library slow
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 1 [get_ports {r1[12]}]
set_load -pin_load 1 [get_ports {r1[11]}]
set_load -pin_load 1 [get_ports {r1[10]}]
set_load -pin_load 1 [get_ports {r1[9]}]
set_load -pin_load 1 [get_ports {r1[8]}]
set_load -pin_load 1 [get_ports {r1[7]}]
set_load -pin_load 1 [get_ports {r1[6]}]
set_load -pin_load 1 [get_ports {r1[5]}]
set_load -pin_load 1 [get_ports {r1[4]}]
set_load -pin_load 1 [get_ports {r1[3]}]
set_load -pin_load 1 [get_ports {r1[2]}]
set_load -pin_load 1 [get_ports {r1[1]}]
set_load -pin_load 1 [get_ports {r1[0]}]
set_load -pin_load 1 [get_ports {r2[12]}]
set_load -pin_load 1 [get_ports {r2[11]}]
set_load -pin_load 1 [get_ports {r2[10]}]
set_load -pin_load 1 [get_ports {r2[9]}]
set_load -pin_load 1 [get_ports {r2[8]}]
set_load -pin_load 1 [get_ports {r2[7]}]
set_load -pin_load 1 [get_ports {r2[6]}]
set_load -pin_load 1 [get_ports {r2[5]}]
set_load -pin_load 1 [get_ports {r2[4]}]
set_load -pin_load 1 [get_ports {r2[3]}]
set_load -pin_load 1 [get_ports {r2[2]}]
set_load -pin_load 1 [get_ports {r2[1]}]
set_load -pin_load 1 [get_ports {r2[0]}]
set_load -pin_load 1 [get_ports {r3[12]}]
set_load -pin_load 1 [get_ports {r3[11]}]
set_load -pin_load 1 [get_ports {r3[10]}]
set_load -pin_load 1 [get_ports {r3[9]}]
set_load -pin_load 1 [get_ports {r3[8]}]
set_load -pin_load 1 [get_ports {r3[7]}]
set_load -pin_load 1 [get_ports {r3[6]}]
set_load -pin_load 1 [get_ports {r3[5]}]
set_load -pin_load 1 [get_ports {r3[4]}]
set_load -pin_load 1 [get_ports {r3[3]}]
set_load -pin_load 1 [get_ports {r3[2]}]
set_load -pin_load 1 [get_ports {r3[1]}]
set_load -pin_load 1 [get_ports {r3[0]}]
set_load -pin_load 1 [get_ports {r4[12]}]
set_load -pin_load 1 [get_ports {r4[11]}]
set_load -pin_load 1 [get_ports {r4[10]}]
set_load -pin_load 1 [get_ports {r4[9]}]
set_load -pin_load 1 [get_ports {r4[8]}]
set_load -pin_load 1 [get_ports {r4[7]}]
set_load -pin_load 1 [get_ports {r4[6]}]
set_load -pin_load 1 [get_ports {r4[5]}]
set_load -pin_load 1 [get_ports {r4[4]}]
set_load -pin_load 1 [get_ports {r4[3]}]
set_load -pin_load 1 [get_ports {r4[2]}]
set_load -pin_load 1 [get_ports {r4[1]}]
set_load -pin_load 1 [get_ports {r4[0]}]
set_max_fanout 20 [get_ports clk]
set_max_fanout 20 [get_ports rst]
set_max_fanout 20 [get_ports {a11[12]}]
set_max_fanout 20 [get_ports {a11[11]}]
set_max_fanout 20 [get_ports {a11[10]}]
set_max_fanout 20 [get_ports {a11[9]}]
set_max_fanout 20 [get_ports {a11[8]}]
set_max_fanout 20 [get_ports {a11[7]}]
set_max_fanout 20 [get_ports {a11[6]}]
set_max_fanout 20 [get_ports {a11[5]}]
set_max_fanout 20 [get_ports {a11[4]}]
set_max_fanout 20 [get_ports {a11[3]}]
set_max_fanout 20 [get_ports {a11[2]}]
set_max_fanout 20 [get_ports {a11[1]}]
set_max_fanout 20 [get_ports {a11[0]}]
set_max_fanout 20 [get_ports {a12[12]}]
set_max_fanout 20 [get_ports {a12[11]}]
set_max_fanout 20 [get_ports {a12[10]}]
set_max_fanout 20 [get_ports {a12[9]}]
set_max_fanout 20 [get_ports {a12[8]}]
set_max_fanout 20 [get_ports {a12[7]}]
set_max_fanout 20 [get_ports {a12[6]}]
set_max_fanout 20 [get_ports {a12[5]}]
set_max_fanout 20 [get_ports {a12[4]}]
set_max_fanout 20 [get_ports {a12[3]}]
set_max_fanout 20 [get_ports {a12[2]}]
set_max_fanout 20 [get_ports {a12[1]}]
set_max_fanout 20 [get_ports {a12[0]}]
set_max_fanout 20 [get_ports {a13[12]}]
set_max_fanout 20 [get_ports {a13[11]}]
set_max_fanout 20 [get_ports {a13[10]}]
set_max_fanout 20 [get_ports {a13[9]}]
set_max_fanout 20 [get_ports {a13[8]}]
set_max_fanout 20 [get_ports {a13[7]}]
set_max_fanout 20 [get_ports {a13[6]}]
set_max_fanout 20 [get_ports {a13[5]}]
set_max_fanout 20 [get_ports {a13[4]}]
set_max_fanout 20 [get_ports {a13[3]}]
set_max_fanout 20 [get_ports {a13[2]}]
set_max_fanout 20 [get_ports {a13[1]}]
set_max_fanout 20 [get_ports {a13[0]}]
set_max_fanout 20 [get_ports {a14[12]}]
set_max_fanout 20 [get_ports {a14[11]}]
set_max_fanout 20 [get_ports {a14[10]}]
set_max_fanout 20 [get_ports {a14[9]}]
set_max_fanout 20 [get_ports {a14[8]}]
set_max_fanout 20 [get_ports {a14[7]}]
set_max_fanout 20 [get_ports {a14[6]}]
set_max_fanout 20 [get_ports {a14[5]}]
set_max_fanout 20 [get_ports {a14[4]}]
set_max_fanout 20 [get_ports {a14[3]}]
set_max_fanout 20 [get_ports {a14[2]}]
set_max_fanout 20 [get_ports {a14[1]}]
set_max_fanout 20 [get_ports {a14[0]}]
set_max_fanout 20 [get_ports {a21[12]}]
set_max_fanout 20 [get_ports {a21[11]}]
set_max_fanout 20 [get_ports {a21[10]}]
set_max_fanout 20 [get_ports {a21[9]}]
set_max_fanout 20 [get_ports {a21[8]}]
set_max_fanout 20 [get_ports {a21[7]}]
set_max_fanout 20 [get_ports {a21[6]}]
set_max_fanout 20 [get_ports {a21[5]}]
set_max_fanout 20 [get_ports {a21[4]}]
set_max_fanout 20 [get_ports {a21[3]}]
set_max_fanout 20 [get_ports {a21[2]}]
set_max_fanout 20 [get_ports {a21[1]}]
set_max_fanout 20 [get_ports {a21[0]}]
set_max_fanout 20 [get_ports {a22[12]}]
set_max_fanout 20 [get_ports {a22[11]}]
set_max_fanout 20 [get_ports {a22[10]}]
set_max_fanout 20 [get_ports {a22[9]}]
set_max_fanout 20 [get_ports {a22[8]}]
set_max_fanout 20 [get_ports {a22[7]}]
set_max_fanout 20 [get_ports {a22[6]}]
set_max_fanout 20 [get_ports {a22[5]}]
set_max_fanout 20 [get_ports {a22[4]}]
set_max_fanout 20 [get_ports {a22[3]}]
set_max_fanout 20 [get_ports {a22[2]}]
set_max_fanout 20 [get_ports {a22[1]}]
set_max_fanout 20 [get_ports {a22[0]}]
set_max_fanout 20 [get_ports {a23[12]}]
set_max_fanout 20 [get_ports {a23[11]}]
set_max_fanout 20 [get_ports {a23[10]}]
set_max_fanout 20 [get_ports {a23[9]}]
set_max_fanout 20 [get_ports {a23[8]}]
set_max_fanout 20 [get_ports {a23[7]}]
set_max_fanout 20 [get_ports {a23[6]}]
set_max_fanout 20 [get_ports {a23[5]}]
set_max_fanout 20 [get_ports {a23[4]}]
set_max_fanout 20 [get_ports {a23[3]}]
set_max_fanout 20 [get_ports {a23[2]}]
set_max_fanout 20 [get_ports {a23[1]}]
set_max_fanout 20 [get_ports {a23[0]}]
set_max_fanout 20 [get_ports {a24[12]}]
set_max_fanout 20 [get_ports {a24[11]}]
set_max_fanout 20 [get_ports {a24[10]}]
set_max_fanout 20 [get_ports {a24[9]}]
set_max_fanout 20 [get_ports {a24[8]}]
set_max_fanout 20 [get_ports {a24[7]}]
set_max_fanout 20 [get_ports {a24[6]}]
set_max_fanout 20 [get_ports {a24[5]}]
set_max_fanout 20 [get_ports {a24[4]}]
set_max_fanout 20 [get_ports {a24[3]}]
set_max_fanout 20 [get_ports {a24[2]}]
set_max_fanout 20 [get_ports {a24[1]}]
set_max_fanout 20 [get_ports {a24[0]}]
set_max_fanout 20 [get_ports {a31[12]}]
set_max_fanout 20 [get_ports {a31[11]}]
set_max_fanout 20 [get_ports {a31[10]}]
set_max_fanout 20 [get_ports {a31[9]}]
set_max_fanout 20 [get_ports {a31[8]}]
set_max_fanout 20 [get_ports {a31[7]}]
set_max_fanout 20 [get_ports {a31[6]}]
set_max_fanout 20 [get_ports {a31[5]}]
set_max_fanout 20 [get_ports {a31[4]}]
set_max_fanout 20 [get_ports {a31[3]}]
set_max_fanout 20 [get_ports {a31[2]}]
set_max_fanout 20 [get_ports {a31[1]}]
set_max_fanout 20 [get_ports {a31[0]}]
set_max_fanout 20 [get_ports {a32[12]}]
set_max_fanout 20 [get_ports {a32[11]}]
set_max_fanout 20 [get_ports {a32[10]}]
set_max_fanout 20 [get_ports {a32[9]}]
set_max_fanout 20 [get_ports {a32[8]}]
set_max_fanout 20 [get_ports {a32[7]}]
set_max_fanout 20 [get_ports {a32[6]}]
set_max_fanout 20 [get_ports {a32[5]}]
set_max_fanout 20 [get_ports {a32[4]}]
set_max_fanout 20 [get_ports {a32[3]}]
set_max_fanout 20 [get_ports {a32[2]}]
set_max_fanout 20 [get_ports {a32[1]}]
set_max_fanout 20 [get_ports {a32[0]}]
set_max_fanout 20 [get_ports {a33[12]}]
set_max_fanout 20 [get_ports {a33[11]}]
set_max_fanout 20 [get_ports {a33[10]}]
set_max_fanout 20 [get_ports {a33[9]}]
set_max_fanout 20 [get_ports {a33[8]}]
set_max_fanout 20 [get_ports {a33[7]}]
set_max_fanout 20 [get_ports {a33[6]}]
set_max_fanout 20 [get_ports {a33[5]}]
set_max_fanout 20 [get_ports {a33[4]}]
set_max_fanout 20 [get_ports {a33[3]}]
set_max_fanout 20 [get_ports {a33[2]}]
set_max_fanout 20 [get_ports {a33[1]}]
set_max_fanout 20 [get_ports {a33[0]}]
set_max_fanout 20 [get_ports {a34[12]}]
set_max_fanout 20 [get_ports {a34[11]}]
set_max_fanout 20 [get_ports {a34[10]}]
set_max_fanout 20 [get_ports {a34[9]}]
set_max_fanout 20 [get_ports {a34[8]}]
set_max_fanout 20 [get_ports {a34[7]}]
set_max_fanout 20 [get_ports {a34[6]}]
set_max_fanout 20 [get_ports {a34[5]}]
set_max_fanout 20 [get_ports {a34[4]}]
set_max_fanout 20 [get_ports {a34[3]}]
set_max_fanout 20 [get_ports {a34[2]}]
set_max_fanout 20 [get_ports {a34[1]}]
set_max_fanout 20 [get_ports {a34[0]}]
set_max_fanout 20 [get_ports {a41[12]}]
set_max_fanout 20 [get_ports {a41[11]}]
set_max_fanout 20 [get_ports {a41[10]}]
set_max_fanout 20 [get_ports {a41[9]}]
set_max_fanout 20 [get_ports {a41[8]}]
set_max_fanout 20 [get_ports {a41[7]}]
set_max_fanout 20 [get_ports {a41[6]}]
set_max_fanout 20 [get_ports {a41[5]}]
set_max_fanout 20 [get_ports {a41[4]}]
set_max_fanout 20 [get_ports {a41[3]}]
set_max_fanout 20 [get_ports {a41[2]}]
set_max_fanout 20 [get_ports {a41[1]}]
set_max_fanout 20 [get_ports {a41[0]}]
set_max_fanout 20 [get_ports {a42[12]}]
set_max_fanout 20 [get_ports {a42[11]}]
set_max_fanout 20 [get_ports {a42[10]}]
set_max_fanout 20 [get_ports {a42[9]}]
set_max_fanout 20 [get_ports {a42[8]}]
set_max_fanout 20 [get_ports {a42[7]}]
set_max_fanout 20 [get_ports {a42[6]}]
set_max_fanout 20 [get_ports {a42[5]}]
set_max_fanout 20 [get_ports {a42[4]}]
set_max_fanout 20 [get_ports {a42[3]}]
set_max_fanout 20 [get_ports {a42[2]}]
set_max_fanout 20 [get_ports {a42[1]}]
set_max_fanout 20 [get_ports {a42[0]}]
set_max_fanout 20 [get_ports {a43[12]}]
set_max_fanout 20 [get_ports {a43[11]}]
set_max_fanout 20 [get_ports {a43[10]}]
set_max_fanout 20 [get_ports {a43[9]}]
set_max_fanout 20 [get_ports {a43[8]}]
set_max_fanout 20 [get_ports {a43[7]}]
set_max_fanout 20 [get_ports {a43[6]}]
set_max_fanout 20 [get_ports {a43[5]}]
set_max_fanout 20 [get_ports {a43[4]}]
set_max_fanout 20 [get_ports {a43[3]}]
set_max_fanout 20 [get_ports {a43[2]}]
set_max_fanout 20 [get_ports {a43[1]}]
set_max_fanout 20 [get_ports {a43[0]}]
set_max_fanout 20 [get_ports {a44[12]}]
set_max_fanout 20 [get_ports {a44[11]}]
set_max_fanout 20 [get_ports {a44[10]}]
set_max_fanout 20 [get_ports {a44[9]}]
set_max_fanout 20 [get_ports {a44[8]}]
set_max_fanout 20 [get_ports {a44[7]}]
set_max_fanout 20 [get_ports {a44[6]}]
set_max_fanout 20 [get_ports {a44[5]}]
set_max_fanout 20 [get_ports {a44[4]}]
set_max_fanout 20 [get_ports {a44[3]}]
set_max_fanout 20 [get_ports {a44[2]}]
set_max_fanout 20 [get_ports {a44[1]}]
set_max_fanout 20 [get_ports {a44[0]}]
set_max_fanout 20 [get_ports {a51[12]}]
set_max_fanout 20 [get_ports {a51[11]}]
set_max_fanout 20 [get_ports {a51[10]}]
set_max_fanout 20 [get_ports {a51[9]}]
set_max_fanout 20 [get_ports {a51[8]}]
set_max_fanout 20 [get_ports {a51[7]}]
set_max_fanout 20 [get_ports {a51[6]}]
set_max_fanout 20 [get_ports {a51[5]}]
set_max_fanout 20 [get_ports {a51[4]}]
set_max_fanout 20 [get_ports {a51[3]}]
set_max_fanout 20 [get_ports {a51[2]}]
set_max_fanout 20 [get_ports {a51[1]}]
set_max_fanout 20 [get_ports {a51[0]}]
set_max_fanout 20 [get_ports {a52[12]}]
set_max_fanout 20 [get_ports {a52[11]}]
set_max_fanout 20 [get_ports {a52[10]}]
set_max_fanout 20 [get_ports {a52[9]}]
set_max_fanout 20 [get_ports {a52[8]}]
set_max_fanout 20 [get_ports {a52[7]}]
set_max_fanout 20 [get_ports {a52[6]}]
set_max_fanout 20 [get_ports {a52[5]}]
set_max_fanout 20 [get_ports {a52[4]}]
set_max_fanout 20 [get_ports {a52[3]}]
set_max_fanout 20 [get_ports {a52[2]}]
set_max_fanout 20 [get_ports {a52[1]}]
set_max_fanout 20 [get_ports {a52[0]}]
set_max_fanout 20 [get_ports {a53[12]}]
set_max_fanout 20 [get_ports {a53[11]}]
set_max_fanout 20 [get_ports {a53[10]}]
set_max_fanout 20 [get_ports {a53[9]}]
set_max_fanout 20 [get_ports {a53[8]}]
set_max_fanout 20 [get_ports {a53[7]}]
set_max_fanout 20 [get_ports {a53[6]}]
set_max_fanout 20 [get_ports {a53[5]}]
set_max_fanout 20 [get_ports {a53[4]}]
set_max_fanout 20 [get_ports {a53[3]}]
set_max_fanout 20 [get_ports {a53[2]}]
set_max_fanout 20 [get_ports {a53[1]}]
set_max_fanout 20 [get_ports {a53[0]}]
set_max_fanout 20 [get_ports {a54[12]}]
set_max_fanout 20 [get_ports {a54[11]}]
set_max_fanout 20 [get_ports {a54[10]}]
set_max_fanout 20 [get_ports {a54[9]}]
set_max_fanout 20 [get_ports {a54[8]}]
set_max_fanout 20 [get_ports {a54[7]}]
set_max_fanout 20 [get_ports {a54[6]}]
set_max_fanout 20 [get_ports {a54[5]}]
set_max_fanout 20 [get_ports {a54[4]}]
set_max_fanout 20 [get_ports {a54[3]}]
set_max_fanout 20 [get_ports {a54[2]}]
set_max_fanout 20 [get_ports {a54[1]}]
set_max_fanout 20 [get_ports {a54[0]}]
set_max_fanout 20 [get_ports {a61[12]}]
set_max_fanout 20 [get_ports {a61[11]}]
set_max_fanout 20 [get_ports {a61[10]}]
set_max_fanout 20 [get_ports {a61[9]}]
set_max_fanout 20 [get_ports {a61[8]}]
set_max_fanout 20 [get_ports {a61[7]}]
set_max_fanout 20 [get_ports {a61[6]}]
set_max_fanout 20 [get_ports {a61[5]}]
set_max_fanout 20 [get_ports {a61[4]}]
set_max_fanout 20 [get_ports {a61[3]}]
set_max_fanout 20 [get_ports {a61[2]}]
set_max_fanout 20 [get_ports {a61[1]}]
set_max_fanout 20 [get_ports {a61[0]}]
set_max_fanout 20 [get_ports {a62[12]}]
set_max_fanout 20 [get_ports {a62[11]}]
set_max_fanout 20 [get_ports {a62[10]}]
set_max_fanout 20 [get_ports {a62[9]}]
set_max_fanout 20 [get_ports {a62[8]}]
set_max_fanout 20 [get_ports {a62[7]}]
set_max_fanout 20 [get_ports {a62[6]}]
set_max_fanout 20 [get_ports {a62[5]}]
set_max_fanout 20 [get_ports {a62[4]}]
set_max_fanout 20 [get_ports {a62[3]}]
set_max_fanout 20 [get_ports {a62[2]}]
set_max_fanout 20 [get_ports {a62[1]}]
set_max_fanout 20 [get_ports {a62[0]}]
set_max_fanout 20 [get_ports {a63[12]}]
set_max_fanout 20 [get_ports {a63[11]}]
set_max_fanout 20 [get_ports {a63[10]}]
set_max_fanout 20 [get_ports {a63[9]}]
set_max_fanout 20 [get_ports {a63[8]}]
set_max_fanout 20 [get_ports {a63[7]}]
set_max_fanout 20 [get_ports {a63[6]}]
set_max_fanout 20 [get_ports {a63[5]}]
set_max_fanout 20 [get_ports {a63[4]}]
set_max_fanout 20 [get_ports {a63[3]}]
set_max_fanout 20 [get_ports {a63[2]}]
set_max_fanout 20 [get_ports {a63[1]}]
set_max_fanout 20 [get_ports {a63[0]}]
set_max_fanout 20 [get_ports {a64[12]}]
set_max_fanout 20 [get_ports {a64[11]}]
set_max_fanout 20 [get_ports {a64[10]}]
set_max_fanout 20 [get_ports {a64[9]}]
set_max_fanout 20 [get_ports {a64[8]}]
set_max_fanout 20 [get_ports {a64[7]}]
set_max_fanout 20 [get_ports {a64[6]}]
set_max_fanout 20 [get_ports {a64[5]}]
set_max_fanout 20 [get_ports {a64[4]}]
set_max_fanout 20 [get_ports {a64[3]}]
set_max_fanout 20 [get_ports {a64[2]}]
set_max_fanout 20 [get_ports {a64[1]}]
set_max_fanout 20 [get_ports {a64[0]}]
set_max_fanout 20 [get_ports {a71[12]}]
set_max_fanout 20 [get_ports {a71[11]}]
set_max_fanout 20 [get_ports {a71[10]}]
set_max_fanout 20 [get_ports {a71[9]}]
set_max_fanout 20 [get_ports {a71[8]}]
set_max_fanout 20 [get_ports {a71[7]}]
set_max_fanout 20 [get_ports {a71[6]}]
set_max_fanout 20 [get_ports {a71[5]}]
set_max_fanout 20 [get_ports {a71[4]}]
set_max_fanout 20 [get_ports {a71[3]}]
set_max_fanout 20 [get_ports {a71[2]}]
set_max_fanout 20 [get_ports {a71[1]}]
set_max_fanout 20 [get_ports {a71[0]}]
set_max_fanout 20 [get_ports {a72[12]}]
set_max_fanout 20 [get_ports {a72[11]}]
set_max_fanout 20 [get_ports {a72[10]}]
set_max_fanout 20 [get_ports {a72[9]}]
set_max_fanout 20 [get_ports {a72[8]}]
set_max_fanout 20 [get_ports {a72[7]}]
set_max_fanout 20 [get_ports {a72[6]}]
set_max_fanout 20 [get_ports {a72[5]}]
set_max_fanout 20 [get_ports {a72[4]}]
set_max_fanout 20 [get_ports {a72[3]}]
set_max_fanout 20 [get_ports {a72[2]}]
set_max_fanout 20 [get_ports {a72[1]}]
set_max_fanout 20 [get_ports {a72[0]}]
set_max_fanout 20 [get_ports {a73[12]}]
set_max_fanout 20 [get_ports {a73[11]}]
set_max_fanout 20 [get_ports {a73[10]}]
set_max_fanout 20 [get_ports {a73[9]}]
set_max_fanout 20 [get_ports {a73[8]}]
set_max_fanout 20 [get_ports {a73[7]}]
set_max_fanout 20 [get_ports {a73[6]}]
set_max_fanout 20 [get_ports {a73[5]}]
set_max_fanout 20 [get_ports {a73[4]}]
set_max_fanout 20 [get_ports {a73[3]}]
set_max_fanout 20 [get_ports {a73[2]}]
set_max_fanout 20 [get_ports {a73[1]}]
set_max_fanout 20 [get_ports {a73[0]}]
set_max_fanout 20 [get_ports {a74[12]}]
set_max_fanout 20 [get_ports {a74[11]}]
set_max_fanout 20 [get_ports {a74[10]}]
set_max_fanout 20 [get_ports {a74[9]}]
set_max_fanout 20 [get_ports {a74[8]}]
set_max_fanout 20 [get_ports {a74[7]}]
set_max_fanout 20 [get_ports {a74[6]}]
set_max_fanout 20 [get_ports {a74[5]}]
set_max_fanout 20 [get_ports {a74[4]}]
set_max_fanout 20 [get_ports {a74[3]}]
set_max_fanout 20 [get_ports {a74[2]}]
set_max_fanout 20 [get_ports {a74[1]}]
set_max_fanout 20 [get_ports {a74[0]}]
set_max_fanout 20 [get_ports {a81[12]}]
set_max_fanout 20 [get_ports {a81[11]}]
set_max_fanout 20 [get_ports {a81[10]}]
set_max_fanout 20 [get_ports {a81[9]}]
set_max_fanout 20 [get_ports {a81[8]}]
set_max_fanout 20 [get_ports {a81[7]}]
set_max_fanout 20 [get_ports {a81[6]}]
set_max_fanout 20 [get_ports {a81[5]}]
set_max_fanout 20 [get_ports {a81[4]}]
set_max_fanout 20 [get_ports {a81[3]}]
set_max_fanout 20 [get_ports {a81[2]}]
set_max_fanout 20 [get_ports {a81[1]}]
set_max_fanout 20 [get_ports {a81[0]}]
set_max_fanout 20 [get_ports {a82[12]}]
set_max_fanout 20 [get_ports {a82[11]}]
set_max_fanout 20 [get_ports {a82[10]}]
set_max_fanout 20 [get_ports {a82[9]}]
set_max_fanout 20 [get_ports {a82[8]}]
set_max_fanout 20 [get_ports {a82[7]}]
set_max_fanout 20 [get_ports {a82[6]}]
set_max_fanout 20 [get_ports {a82[5]}]
set_max_fanout 20 [get_ports {a82[4]}]
set_max_fanout 20 [get_ports {a82[3]}]
set_max_fanout 20 [get_ports {a82[2]}]
set_max_fanout 20 [get_ports {a82[1]}]
set_max_fanout 20 [get_ports {a82[0]}]
set_max_fanout 20 [get_ports {a83[12]}]
set_max_fanout 20 [get_ports {a83[11]}]
set_max_fanout 20 [get_ports {a83[10]}]
set_max_fanout 20 [get_ports {a83[9]}]
set_max_fanout 20 [get_ports {a83[8]}]
set_max_fanout 20 [get_ports {a83[7]}]
set_max_fanout 20 [get_ports {a83[6]}]
set_max_fanout 20 [get_ports {a83[5]}]
set_max_fanout 20 [get_ports {a83[4]}]
set_max_fanout 20 [get_ports {a83[3]}]
set_max_fanout 20 [get_ports {a83[2]}]
set_max_fanout 20 [get_ports {a83[1]}]
set_max_fanout 20 [get_ports {a83[0]}]
set_max_fanout 20 [get_ports {a84[12]}]
set_max_fanout 20 [get_ports {a84[11]}]
set_max_fanout 20 [get_ports {a84[10]}]
set_max_fanout 20 [get_ports {a84[9]}]
set_max_fanout 20 [get_ports {a84[8]}]
set_max_fanout 20 [get_ports {a84[7]}]
set_max_fanout 20 [get_ports {a84[6]}]
set_max_fanout 20 [get_ports {a84[5]}]
set_max_fanout 20 [get_ports {a84[4]}]
set_max_fanout 20 [get_ports {a84[3]}]
set_max_fanout 20 [get_ports {a84[2]}]
set_max_fanout 20 [get_ports {a84[1]}]
set_max_fanout 20 [get_ports {a84[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 9.3  -waveform {0 4.65}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  -clock_fall  0  [get_ports rst]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a11[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a11[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a11[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a11[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a11[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a11[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a11[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a11[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a11[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a11[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a11[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a11[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a11[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a12[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a12[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a12[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a12[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a12[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a12[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a12[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a12[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a12[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a12[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a12[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a12[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a12[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a13[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a13[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a13[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a13[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a13[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a13[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a13[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a13[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a13[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a13[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a13[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a13[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a13[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a14[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a14[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a14[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a14[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a14[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a14[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a14[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a14[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a14[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a14[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a14[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a14[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a14[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a21[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a21[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a21[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a21[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a21[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a21[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a21[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a21[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a21[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a21[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a21[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a21[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a21[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a22[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a22[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a22[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a22[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a22[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a22[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a22[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a22[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a22[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a22[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a22[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a22[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a22[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a23[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a23[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a23[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a23[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a23[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a23[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a23[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a23[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a23[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a23[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a23[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a23[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a23[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a24[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a24[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a24[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a24[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a24[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a24[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a24[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a24[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a24[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a24[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a24[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a24[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a24[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a31[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a31[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a31[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a31[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a31[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a31[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a31[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a31[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a31[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a31[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a31[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a31[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a31[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a32[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a32[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a32[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a32[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a32[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a32[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a32[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a32[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a32[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a32[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a32[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a32[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a32[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a33[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a33[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a33[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a33[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a33[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a33[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a33[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a33[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a33[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a33[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a33[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a33[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a33[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a34[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a34[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a34[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a34[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a34[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a34[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a34[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a34[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a34[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a34[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a34[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a34[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a34[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a41[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a41[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a41[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a41[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a41[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a41[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a41[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a41[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a41[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a41[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a41[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a41[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a41[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a42[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a42[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a42[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a42[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a42[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a42[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a42[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a42[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a42[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a42[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a42[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a42[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a42[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a43[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a43[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a43[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a43[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a43[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a43[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a43[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a43[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a43[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a43[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a43[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a43[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a43[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a44[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a44[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a44[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a44[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a44[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a44[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a44[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a44[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a44[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a44[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a44[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a44[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a44[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a51[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a51[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a51[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a51[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a51[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a51[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a51[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a51[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a51[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a51[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a51[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a51[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a51[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a52[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a52[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a52[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a52[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a52[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a52[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a52[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a52[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a52[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a52[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a52[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a52[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a52[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a53[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a53[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a53[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a53[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a53[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a53[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a53[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a53[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a53[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a53[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a53[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a53[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a53[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a54[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a54[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a54[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a54[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a54[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a54[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a54[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a54[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a54[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a54[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a54[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a54[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a54[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a61[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a61[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a61[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a61[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a61[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a61[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a61[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a61[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a61[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a61[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a61[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a61[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a61[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a62[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a62[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a62[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a62[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a62[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a62[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a62[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a62[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a62[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a62[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a62[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a62[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a62[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a63[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a63[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a63[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a63[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a63[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a63[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a63[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a63[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a63[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a63[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a63[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a63[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a63[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a64[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a64[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a64[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a64[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a64[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a64[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a64[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a64[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a64[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a64[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a64[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a64[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a64[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a71[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a71[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a71[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a71[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a71[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a71[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a71[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a71[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a71[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a71[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a71[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a71[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a71[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a72[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a72[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a72[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a72[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a72[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a72[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a72[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a72[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a72[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a72[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a72[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a72[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a72[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a73[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a73[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a73[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a73[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a73[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a73[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a73[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a73[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a73[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a73[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a73[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a73[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a73[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a74[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a74[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a74[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a74[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a74[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a74[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a74[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a74[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a74[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a74[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a74[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a74[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a74[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a81[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a81[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a81[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a81[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a81[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a81[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a81[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a81[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a81[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a81[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a81[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a81[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a81[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a82[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a82[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a82[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a82[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a82[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a82[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a82[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a82[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a82[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a82[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a82[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a82[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a82[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a83[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a83[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a83[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a83[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a83[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a83[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a83[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a83[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a83[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a83[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a83[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a83[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a83[0]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a84[12]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a84[11]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a84[10]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a84[9]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a84[8]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a84[7]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a84[6]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a84[5]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a84[4]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a84[3]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a84[2]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a84[1]}]
set_input_delay -clock clk  -clock_fall  0  [get_ports {a84[0]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r1[12]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r1[11]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r1[10]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r1[9]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r1[8]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r1[7]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r1[6]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r1[5]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r1[4]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r1[3]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r1[2]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r1[1]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r1[0]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r2[12]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r2[11]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r2[10]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r2[9]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r2[8]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r2[7]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r2[6]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r2[5]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r2[4]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r2[3]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r2[2]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r2[1]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r2[0]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r3[12]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r3[11]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r3[10]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r3[9]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r3[8]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r3[7]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r3[6]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r3[5]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r3[4]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r3[3]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r3[2]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r3[1]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r3[0]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r4[12]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r4[11]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r4[10]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r4[9]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r4[8]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r4[7]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r4[6]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r4[5]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r4[4]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r4[3]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r4[2]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r4[1]}]
set_output_delay -clock clk  -clock_fall  0  [get_ports {r4[0]}]
set_drive 0.1  [get_ports clk]
set_drive 0.1  [get_ports rst]
set_drive 0.1  [get_ports {a11[12]}]
set_drive 0.1  [get_ports {a11[11]}]
set_drive 0.1  [get_ports {a11[10]}]
set_drive 0.1  [get_ports {a11[9]}]
set_drive 0.1  [get_ports {a11[8]}]
set_drive 0.1  [get_ports {a11[7]}]
set_drive 0.1  [get_ports {a11[6]}]
set_drive 0.1  [get_ports {a11[5]}]
set_drive 0.1  [get_ports {a11[4]}]
set_drive 0.1  [get_ports {a11[3]}]
set_drive 0.1  [get_ports {a11[2]}]
set_drive 0.1  [get_ports {a11[1]}]
set_drive 0.1  [get_ports {a11[0]}]
set_drive 0.1  [get_ports {a12[12]}]
set_drive 0.1  [get_ports {a12[11]}]
set_drive 0.1  [get_ports {a12[10]}]
set_drive 0.1  [get_ports {a12[9]}]
set_drive 0.1  [get_ports {a12[8]}]
set_drive 0.1  [get_ports {a12[7]}]
set_drive 0.1  [get_ports {a12[6]}]
set_drive 0.1  [get_ports {a12[5]}]
set_drive 0.1  [get_ports {a12[4]}]
set_drive 0.1  [get_ports {a12[3]}]
set_drive 0.1  [get_ports {a12[2]}]
set_drive 0.1  [get_ports {a12[1]}]
set_drive 0.1  [get_ports {a12[0]}]
set_drive 0.1  [get_ports {a13[12]}]
set_drive 0.1  [get_ports {a13[11]}]
set_drive 0.1  [get_ports {a13[10]}]
set_drive 0.1  [get_ports {a13[9]}]
set_drive 0.1  [get_ports {a13[8]}]
set_drive 0.1  [get_ports {a13[7]}]
set_drive 0.1  [get_ports {a13[6]}]
set_drive 0.1  [get_ports {a13[5]}]
set_drive 0.1  [get_ports {a13[4]}]
set_drive 0.1  [get_ports {a13[3]}]
set_drive 0.1  [get_ports {a13[2]}]
set_drive 0.1  [get_ports {a13[1]}]
set_drive 0.1  [get_ports {a13[0]}]
set_drive 0.1  [get_ports {a14[12]}]
set_drive 0.1  [get_ports {a14[11]}]
set_drive 0.1  [get_ports {a14[10]}]
set_drive 0.1  [get_ports {a14[9]}]
set_drive 0.1  [get_ports {a14[8]}]
set_drive 0.1  [get_ports {a14[7]}]
set_drive 0.1  [get_ports {a14[6]}]
set_drive 0.1  [get_ports {a14[5]}]
set_drive 0.1  [get_ports {a14[4]}]
set_drive 0.1  [get_ports {a14[3]}]
set_drive 0.1  [get_ports {a14[2]}]
set_drive 0.1  [get_ports {a14[1]}]
set_drive 0.1  [get_ports {a14[0]}]
set_drive 0.1  [get_ports {a21[12]}]
set_drive 0.1  [get_ports {a21[11]}]
set_drive 0.1  [get_ports {a21[10]}]
set_drive 0.1  [get_ports {a21[9]}]
set_drive 0.1  [get_ports {a21[8]}]
set_drive 0.1  [get_ports {a21[7]}]
set_drive 0.1  [get_ports {a21[6]}]
set_drive 0.1  [get_ports {a21[5]}]
set_drive 0.1  [get_ports {a21[4]}]
set_drive 0.1  [get_ports {a21[3]}]
set_drive 0.1  [get_ports {a21[2]}]
set_drive 0.1  [get_ports {a21[1]}]
set_drive 0.1  [get_ports {a21[0]}]
set_drive 0.1  [get_ports {a22[12]}]
set_drive 0.1  [get_ports {a22[11]}]
set_drive 0.1  [get_ports {a22[10]}]
set_drive 0.1  [get_ports {a22[9]}]
set_drive 0.1  [get_ports {a22[8]}]
set_drive 0.1  [get_ports {a22[7]}]
set_drive 0.1  [get_ports {a22[6]}]
set_drive 0.1  [get_ports {a22[5]}]
set_drive 0.1  [get_ports {a22[4]}]
set_drive 0.1  [get_ports {a22[3]}]
set_drive 0.1  [get_ports {a22[2]}]
set_drive 0.1  [get_ports {a22[1]}]
set_drive 0.1  [get_ports {a22[0]}]
set_drive 0.1  [get_ports {a23[12]}]
set_drive 0.1  [get_ports {a23[11]}]
set_drive 0.1  [get_ports {a23[10]}]
set_drive 0.1  [get_ports {a23[9]}]
set_drive 0.1  [get_ports {a23[8]}]
set_drive 0.1  [get_ports {a23[7]}]
set_drive 0.1  [get_ports {a23[6]}]
set_drive 0.1  [get_ports {a23[5]}]
set_drive 0.1  [get_ports {a23[4]}]
set_drive 0.1  [get_ports {a23[3]}]
set_drive 0.1  [get_ports {a23[2]}]
set_drive 0.1  [get_ports {a23[1]}]
set_drive 0.1  [get_ports {a23[0]}]
set_drive 0.1  [get_ports {a24[12]}]
set_drive 0.1  [get_ports {a24[11]}]
set_drive 0.1  [get_ports {a24[10]}]
set_drive 0.1  [get_ports {a24[9]}]
set_drive 0.1  [get_ports {a24[8]}]
set_drive 0.1  [get_ports {a24[7]}]
set_drive 0.1  [get_ports {a24[6]}]
set_drive 0.1  [get_ports {a24[5]}]
set_drive 0.1  [get_ports {a24[4]}]
set_drive 0.1  [get_ports {a24[3]}]
set_drive 0.1  [get_ports {a24[2]}]
set_drive 0.1  [get_ports {a24[1]}]
set_drive 0.1  [get_ports {a24[0]}]
set_drive 0.1  [get_ports {a31[12]}]
set_drive 0.1  [get_ports {a31[11]}]
set_drive 0.1  [get_ports {a31[10]}]
set_drive 0.1  [get_ports {a31[9]}]
set_drive 0.1  [get_ports {a31[8]}]
set_drive 0.1  [get_ports {a31[7]}]
set_drive 0.1  [get_ports {a31[6]}]
set_drive 0.1  [get_ports {a31[5]}]
set_drive 0.1  [get_ports {a31[4]}]
set_drive 0.1  [get_ports {a31[3]}]
set_drive 0.1  [get_ports {a31[2]}]
set_drive 0.1  [get_ports {a31[1]}]
set_drive 0.1  [get_ports {a31[0]}]
set_drive 0.1  [get_ports {a32[12]}]
set_drive 0.1  [get_ports {a32[11]}]
set_drive 0.1  [get_ports {a32[10]}]
set_drive 0.1  [get_ports {a32[9]}]
set_drive 0.1  [get_ports {a32[8]}]
set_drive 0.1  [get_ports {a32[7]}]
set_drive 0.1  [get_ports {a32[6]}]
set_drive 0.1  [get_ports {a32[5]}]
set_drive 0.1  [get_ports {a32[4]}]
set_drive 0.1  [get_ports {a32[3]}]
set_drive 0.1  [get_ports {a32[2]}]
set_drive 0.1  [get_ports {a32[1]}]
set_drive 0.1  [get_ports {a32[0]}]
set_drive 0.1  [get_ports {a33[12]}]
set_drive 0.1  [get_ports {a33[11]}]
set_drive 0.1  [get_ports {a33[10]}]
set_drive 0.1  [get_ports {a33[9]}]
set_drive 0.1  [get_ports {a33[8]}]
set_drive 0.1  [get_ports {a33[7]}]
set_drive 0.1  [get_ports {a33[6]}]
set_drive 0.1  [get_ports {a33[5]}]
set_drive 0.1  [get_ports {a33[4]}]
set_drive 0.1  [get_ports {a33[3]}]
set_drive 0.1  [get_ports {a33[2]}]
set_drive 0.1  [get_ports {a33[1]}]
set_drive 0.1  [get_ports {a33[0]}]
set_drive 0.1  [get_ports {a34[12]}]
set_drive 0.1  [get_ports {a34[11]}]
set_drive 0.1  [get_ports {a34[10]}]
set_drive 0.1  [get_ports {a34[9]}]
set_drive 0.1  [get_ports {a34[8]}]
set_drive 0.1  [get_ports {a34[7]}]
set_drive 0.1  [get_ports {a34[6]}]
set_drive 0.1  [get_ports {a34[5]}]
set_drive 0.1  [get_ports {a34[4]}]
set_drive 0.1  [get_ports {a34[3]}]
set_drive 0.1  [get_ports {a34[2]}]
set_drive 0.1  [get_ports {a34[1]}]
set_drive 0.1  [get_ports {a34[0]}]
set_drive 0.1  [get_ports {a41[12]}]
set_drive 0.1  [get_ports {a41[11]}]
set_drive 0.1  [get_ports {a41[10]}]
set_drive 0.1  [get_ports {a41[9]}]
set_drive 0.1  [get_ports {a41[8]}]
set_drive 0.1  [get_ports {a41[7]}]
set_drive 0.1  [get_ports {a41[6]}]
set_drive 0.1  [get_ports {a41[5]}]
set_drive 0.1  [get_ports {a41[4]}]
set_drive 0.1  [get_ports {a41[3]}]
set_drive 0.1  [get_ports {a41[2]}]
set_drive 0.1  [get_ports {a41[1]}]
set_drive 0.1  [get_ports {a41[0]}]
set_drive 0.1  [get_ports {a42[12]}]
set_drive 0.1  [get_ports {a42[11]}]
set_drive 0.1  [get_ports {a42[10]}]
set_drive 0.1  [get_ports {a42[9]}]
set_drive 0.1  [get_ports {a42[8]}]
set_drive 0.1  [get_ports {a42[7]}]
set_drive 0.1  [get_ports {a42[6]}]
set_drive 0.1  [get_ports {a42[5]}]
set_drive 0.1  [get_ports {a42[4]}]
set_drive 0.1  [get_ports {a42[3]}]
set_drive 0.1  [get_ports {a42[2]}]
set_drive 0.1  [get_ports {a42[1]}]
set_drive 0.1  [get_ports {a42[0]}]
set_drive 0.1  [get_ports {a43[12]}]
set_drive 0.1  [get_ports {a43[11]}]
set_drive 0.1  [get_ports {a43[10]}]
set_drive 0.1  [get_ports {a43[9]}]
set_drive 0.1  [get_ports {a43[8]}]
set_drive 0.1  [get_ports {a43[7]}]
set_drive 0.1  [get_ports {a43[6]}]
set_drive 0.1  [get_ports {a43[5]}]
set_drive 0.1  [get_ports {a43[4]}]
set_drive 0.1  [get_ports {a43[3]}]
set_drive 0.1  [get_ports {a43[2]}]
set_drive 0.1  [get_ports {a43[1]}]
set_drive 0.1  [get_ports {a43[0]}]
set_drive 0.1  [get_ports {a44[12]}]
set_drive 0.1  [get_ports {a44[11]}]
set_drive 0.1  [get_ports {a44[10]}]
set_drive 0.1  [get_ports {a44[9]}]
set_drive 0.1  [get_ports {a44[8]}]
set_drive 0.1  [get_ports {a44[7]}]
set_drive 0.1  [get_ports {a44[6]}]
set_drive 0.1  [get_ports {a44[5]}]
set_drive 0.1  [get_ports {a44[4]}]
set_drive 0.1  [get_ports {a44[3]}]
set_drive 0.1  [get_ports {a44[2]}]
set_drive 0.1  [get_ports {a44[1]}]
set_drive 0.1  [get_ports {a44[0]}]
set_drive 0.1  [get_ports {a51[12]}]
set_drive 0.1  [get_ports {a51[11]}]
set_drive 0.1  [get_ports {a51[10]}]
set_drive 0.1  [get_ports {a51[9]}]
set_drive 0.1  [get_ports {a51[8]}]
set_drive 0.1  [get_ports {a51[7]}]
set_drive 0.1  [get_ports {a51[6]}]
set_drive 0.1  [get_ports {a51[5]}]
set_drive 0.1  [get_ports {a51[4]}]
set_drive 0.1  [get_ports {a51[3]}]
set_drive 0.1  [get_ports {a51[2]}]
set_drive 0.1  [get_ports {a51[1]}]
set_drive 0.1  [get_ports {a51[0]}]
set_drive 0.1  [get_ports {a52[12]}]
set_drive 0.1  [get_ports {a52[11]}]
set_drive 0.1  [get_ports {a52[10]}]
set_drive 0.1  [get_ports {a52[9]}]
set_drive 0.1  [get_ports {a52[8]}]
set_drive 0.1  [get_ports {a52[7]}]
set_drive 0.1  [get_ports {a52[6]}]
set_drive 0.1  [get_ports {a52[5]}]
set_drive 0.1  [get_ports {a52[4]}]
set_drive 0.1  [get_ports {a52[3]}]
set_drive 0.1  [get_ports {a52[2]}]
set_drive 0.1  [get_ports {a52[1]}]
set_drive 0.1  [get_ports {a52[0]}]
set_drive 0.1  [get_ports {a53[12]}]
set_drive 0.1  [get_ports {a53[11]}]
set_drive 0.1  [get_ports {a53[10]}]
set_drive 0.1  [get_ports {a53[9]}]
set_drive 0.1  [get_ports {a53[8]}]
set_drive 0.1  [get_ports {a53[7]}]
set_drive 0.1  [get_ports {a53[6]}]
set_drive 0.1  [get_ports {a53[5]}]
set_drive 0.1  [get_ports {a53[4]}]
set_drive 0.1  [get_ports {a53[3]}]
set_drive 0.1  [get_ports {a53[2]}]
set_drive 0.1  [get_ports {a53[1]}]
set_drive 0.1  [get_ports {a53[0]}]
set_drive 0.1  [get_ports {a54[12]}]
set_drive 0.1  [get_ports {a54[11]}]
set_drive 0.1  [get_ports {a54[10]}]
set_drive 0.1  [get_ports {a54[9]}]
set_drive 0.1  [get_ports {a54[8]}]
set_drive 0.1  [get_ports {a54[7]}]
set_drive 0.1  [get_ports {a54[6]}]
set_drive 0.1  [get_ports {a54[5]}]
set_drive 0.1  [get_ports {a54[4]}]
set_drive 0.1  [get_ports {a54[3]}]
set_drive 0.1  [get_ports {a54[2]}]
set_drive 0.1  [get_ports {a54[1]}]
set_drive 0.1  [get_ports {a54[0]}]
set_drive 0.1  [get_ports {a61[12]}]
set_drive 0.1  [get_ports {a61[11]}]
set_drive 0.1  [get_ports {a61[10]}]
set_drive 0.1  [get_ports {a61[9]}]
set_drive 0.1  [get_ports {a61[8]}]
set_drive 0.1  [get_ports {a61[7]}]
set_drive 0.1  [get_ports {a61[6]}]
set_drive 0.1  [get_ports {a61[5]}]
set_drive 0.1  [get_ports {a61[4]}]
set_drive 0.1  [get_ports {a61[3]}]
set_drive 0.1  [get_ports {a61[2]}]
set_drive 0.1  [get_ports {a61[1]}]
set_drive 0.1  [get_ports {a61[0]}]
set_drive 0.1  [get_ports {a62[12]}]
set_drive 0.1  [get_ports {a62[11]}]
set_drive 0.1  [get_ports {a62[10]}]
set_drive 0.1  [get_ports {a62[9]}]
set_drive 0.1  [get_ports {a62[8]}]
set_drive 0.1  [get_ports {a62[7]}]
set_drive 0.1  [get_ports {a62[6]}]
set_drive 0.1  [get_ports {a62[5]}]
set_drive 0.1  [get_ports {a62[4]}]
set_drive 0.1  [get_ports {a62[3]}]
set_drive 0.1  [get_ports {a62[2]}]
set_drive 0.1  [get_ports {a62[1]}]
set_drive 0.1  [get_ports {a62[0]}]
set_drive 0.1  [get_ports {a63[12]}]
set_drive 0.1  [get_ports {a63[11]}]
set_drive 0.1  [get_ports {a63[10]}]
set_drive 0.1  [get_ports {a63[9]}]
set_drive 0.1  [get_ports {a63[8]}]
set_drive 0.1  [get_ports {a63[7]}]
set_drive 0.1  [get_ports {a63[6]}]
set_drive 0.1  [get_ports {a63[5]}]
set_drive 0.1  [get_ports {a63[4]}]
set_drive 0.1  [get_ports {a63[3]}]
set_drive 0.1  [get_ports {a63[2]}]
set_drive 0.1  [get_ports {a63[1]}]
set_drive 0.1  [get_ports {a63[0]}]
set_drive 0.1  [get_ports {a64[12]}]
set_drive 0.1  [get_ports {a64[11]}]
set_drive 0.1  [get_ports {a64[10]}]
set_drive 0.1  [get_ports {a64[9]}]
set_drive 0.1  [get_ports {a64[8]}]
set_drive 0.1  [get_ports {a64[7]}]
set_drive 0.1  [get_ports {a64[6]}]
set_drive 0.1  [get_ports {a64[5]}]
set_drive 0.1  [get_ports {a64[4]}]
set_drive 0.1  [get_ports {a64[3]}]
set_drive 0.1  [get_ports {a64[2]}]
set_drive 0.1  [get_ports {a64[1]}]
set_drive 0.1  [get_ports {a64[0]}]
set_drive 0.1  [get_ports {a71[12]}]
set_drive 0.1  [get_ports {a71[11]}]
set_drive 0.1  [get_ports {a71[10]}]
set_drive 0.1  [get_ports {a71[9]}]
set_drive 0.1  [get_ports {a71[8]}]
set_drive 0.1  [get_ports {a71[7]}]
set_drive 0.1  [get_ports {a71[6]}]
set_drive 0.1  [get_ports {a71[5]}]
set_drive 0.1  [get_ports {a71[4]}]
set_drive 0.1  [get_ports {a71[3]}]
set_drive 0.1  [get_ports {a71[2]}]
set_drive 0.1  [get_ports {a71[1]}]
set_drive 0.1  [get_ports {a71[0]}]
set_drive 0.1  [get_ports {a72[12]}]
set_drive 0.1  [get_ports {a72[11]}]
set_drive 0.1  [get_ports {a72[10]}]
set_drive 0.1  [get_ports {a72[9]}]
set_drive 0.1  [get_ports {a72[8]}]
set_drive 0.1  [get_ports {a72[7]}]
set_drive 0.1  [get_ports {a72[6]}]
set_drive 0.1  [get_ports {a72[5]}]
set_drive 0.1  [get_ports {a72[4]}]
set_drive 0.1  [get_ports {a72[3]}]
set_drive 0.1  [get_ports {a72[2]}]
set_drive 0.1  [get_ports {a72[1]}]
set_drive 0.1  [get_ports {a72[0]}]
set_drive 0.1  [get_ports {a73[12]}]
set_drive 0.1  [get_ports {a73[11]}]
set_drive 0.1  [get_ports {a73[10]}]
set_drive 0.1  [get_ports {a73[9]}]
set_drive 0.1  [get_ports {a73[8]}]
set_drive 0.1  [get_ports {a73[7]}]
set_drive 0.1  [get_ports {a73[6]}]
set_drive 0.1  [get_ports {a73[5]}]
set_drive 0.1  [get_ports {a73[4]}]
set_drive 0.1  [get_ports {a73[3]}]
set_drive 0.1  [get_ports {a73[2]}]
set_drive 0.1  [get_ports {a73[1]}]
set_drive 0.1  [get_ports {a73[0]}]
set_drive 0.1  [get_ports {a74[12]}]
set_drive 0.1  [get_ports {a74[11]}]
set_drive 0.1  [get_ports {a74[10]}]
set_drive 0.1  [get_ports {a74[9]}]
set_drive 0.1  [get_ports {a74[8]}]
set_drive 0.1  [get_ports {a74[7]}]
set_drive 0.1  [get_ports {a74[6]}]
set_drive 0.1  [get_ports {a74[5]}]
set_drive 0.1  [get_ports {a74[4]}]
set_drive 0.1  [get_ports {a74[3]}]
set_drive 0.1  [get_ports {a74[2]}]
set_drive 0.1  [get_ports {a74[1]}]
set_drive 0.1  [get_ports {a74[0]}]
set_drive 0.1  [get_ports {a81[12]}]
set_drive 0.1  [get_ports {a81[11]}]
set_drive 0.1  [get_ports {a81[10]}]
set_drive 0.1  [get_ports {a81[9]}]
set_drive 0.1  [get_ports {a81[8]}]
set_drive 0.1  [get_ports {a81[7]}]
set_drive 0.1  [get_ports {a81[6]}]
set_drive 0.1  [get_ports {a81[5]}]
set_drive 0.1  [get_ports {a81[4]}]
set_drive 0.1  [get_ports {a81[3]}]
set_drive 0.1  [get_ports {a81[2]}]
set_drive 0.1  [get_ports {a81[1]}]
set_drive 0.1  [get_ports {a81[0]}]
set_drive 0.1  [get_ports {a82[12]}]
set_drive 0.1  [get_ports {a82[11]}]
set_drive 0.1  [get_ports {a82[10]}]
set_drive 0.1  [get_ports {a82[9]}]
set_drive 0.1  [get_ports {a82[8]}]
set_drive 0.1  [get_ports {a82[7]}]
set_drive 0.1  [get_ports {a82[6]}]
set_drive 0.1  [get_ports {a82[5]}]
set_drive 0.1  [get_ports {a82[4]}]
set_drive 0.1  [get_ports {a82[3]}]
set_drive 0.1  [get_ports {a82[2]}]
set_drive 0.1  [get_ports {a82[1]}]
set_drive 0.1  [get_ports {a82[0]}]
set_drive 0.1  [get_ports {a83[12]}]
set_drive 0.1  [get_ports {a83[11]}]
set_drive 0.1  [get_ports {a83[10]}]
set_drive 0.1  [get_ports {a83[9]}]
set_drive 0.1  [get_ports {a83[8]}]
set_drive 0.1  [get_ports {a83[7]}]
set_drive 0.1  [get_ports {a83[6]}]
set_drive 0.1  [get_ports {a83[5]}]
set_drive 0.1  [get_ports {a83[4]}]
set_drive 0.1  [get_ports {a83[3]}]
set_drive 0.1  [get_ports {a83[2]}]
set_drive 0.1  [get_ports {a83[1]}]
set_drive 0.1  [get_ports {a83[0]}]
set_drive 0.1  [get_ports {a84[12]}]
set_drive 0.1  [get_ports {a84[11]}]
set_drive 0.1  [get_ports {a84[10]}]
set_drive 0.1  [get_ports {a84[9]}]
set_drive 0.1  [get_ports {a84[8]}]
set_drive 0.1  [get_ports {a84[7]}]
set_drive 0.1  [get_ports {a84[6]}]
set_drive 0.1  [get_ports {a84[5]}]
set_drive 0.1  [get_ports {a84[4]}]
set_drive 0.1  [get_ports {a84[3]}]
set_drive 0.1  [get_ports {a84[2]}]
set_drive 0.1  [get_ports {a84[1]}]
set_drive 0.1  [get_ports {a84[0]}]
